## 🌍 Terraform Plan (GKE - dev)
```hcl

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.hub_cluster[0].keycloak_group.argocd_admins[0] will be created
  + resource "keycloak_group" "argocd_admins" {
      + id       = (known after apply)
      + name     = "ArgoCDAdmins"
      + path     = (known after apply)
      + realm_id = (known after apply)
    }

  # module.hub_cluster[0].keycloak_group.argocd_developers[0] will be created
  + resource "keycloak_group" "argocd_developers" {
      + id       = (known after apply)
      + name     = "ArgoCDDevelopers"
      + path     = (known after apply)
      + realm_id = (known after apply)
    }

  # module.hub_cluster[0].keycloak_group.argocd_viewers[0] will be created
  + resource "keycloak_group" "argocd_viewers" {
      + id       = (known after apply)
      + name     = "ArgoCDViewers"
      + path     = (known after apply)
      + realm_id = (known after apply)
    }

  # module.hub_cluster[0].keycloak_openid_client.argocd[0] will be created
  + resource "keycloak_openid_client" "argocd" {
      + access_token_lifespan                     = "3600"
      + access_type                               = "CONFIDENTIAL"
      + admin_url                                 = "https://argocd.observe.camer.digital"
      + backchannel_logout_session_required       = true
      + base_url                                  = (known after apply)
      + client_authenticator_type                 = "client-secret"
      + client_id                                 = "argocd"
      + client_offline_session_idle_timeout       = (known after apply)
      + client_offline_session_max_lifespan       = (known after apply)
      + client_secret                             = (sensitive value)
      + client_session_idle_timeout               = (known after apply)
      + client_session_max_lifespan               = (known after apply)
      + consent_required                          = (known after apply)
      + consent_screen_text                       = (known after apply)
      + description                               = (known after apply)
      + direct_access_grants_enabled              = true
      + display_on_consent_screen                 = (known after apply)
      + enabled                                   = true
      + exclude_session_state_from_auth_response  = false
      + frontchannel_logout_enabled               = (known after apply)
      + full_scope_allowed                        = true
      + id                                        = (known after apply)
      + implicit_flow_enabled                     = false
      + import                                    = false
      + name                                      = "ArgoCD OIDC Client (Client Authentication)"
      + oauth2_device_authorization_grant_enabled = false
      + realm_id                                  = (known after apply)
      + resource_server_id                        = (known after apply)
      + root_url                                  = "https://argocd.observe.camer.digital"
      + service_account_user_id                   = (known after apply)
      + service_accounts_enabled                  = (known after apply)
      + standard_flow_enabled                     = true
      + use_refresh_tokens                        = true
      + use_refresh_tokens_client_credentials     = false
      + valid_post_logout_redirect_uris           = [
          + "https://argocd.observe.camer.digital/*",
          + "https://argocd.observe.camer.digital/applications",
        ]
      + valid_redirect_uris                       = [
          + "https://argocd.observe.camer.digital/*",
          + "https://argocd.observe.camer.digital/auth/callback",
        ]
      + web_origins                               = [
          + "argocd.observe.camer.digital",
          + "https://argocd.observe.camer.digital",
        ]
    }

  # module.hub_cluster[0].keycloak_openid_client_default_scopes.argocd[0] will be created
  + resource "keycloak_openid_client_default_scopes" "argocd" {
      + client_id      = (known after apply)
      + default_scopes = [
          + "acr",
          + "email",
          + "groups",
          + "openid",
          + "profile",
          + "roles",
          + "web-origins",
        ]
      + id             = (known after apply)
      + realm_id       = (known after apply)
    }

  # module.hub_cluster[0].keycloak_openid_client_scope.groups[0] will be created
  + resource "keycloak_openid_client_scope" "groups" {
      + description            = "Group membership claim for ArgoCD authorization"
      + id                     = (known after apply)
      + include_in_token_scope = true
      + name                   = "groups"
      + realm_id               = (known after apply)
    }

  # module.hub_cluster[0].keycloak_openid_group_membership_protocol_mapper.groups_mapper[0] will be created
  + resource "keycloak_openid_group_membership_protocol_mapper" "groups_mapper" {
      + add_to_access_token = true
      + add_to_id_token     = true
      + add_to_userinfo     = true
      + claim_name          = "groups"
      + client_scope_id     = (known after apply)
      + full_path           = false
      + id                  = (known after apply)
      + name                = "group-membership"
      + realm_id            = (known after apply)
    }

  # module.hub_cluster[0].keycloak_realm.argocd[0] will be created
  + resource "keycloak_realm" "argocd" {
      + access_code_lifespan                     = (known after apply)
      + access_code_lifespan_login               = (known after apply)
      + access_code_lifespan_user_action         = (known after apply)
      + access_token_lifespan                    = (known after apply)
      + access_token_lifespan_for_implicit_flow  = (known after apply)
      + action_token_generated_by_admin_lifespan = (known after apply)
      + action_token_generated_by_user_lifespan  = (known after apply)
      + browser_flow                             = (known after apply)
      + client_authentication_flow               = (known after apply)
      + client_session_idle_timeout              = (known after apply)
      + client_session_max_lifespan              = (known after apply)
      + direct_grant_flow                        = (known after apply)
      + docker_authentication_flow               = (known after apply)
      + duplicate_emails_allowed                 = (known after apply)
      + edit_username_allowed                    = (known after apply)
      + enabled                                  = true
      + id                                       = (known after apply)
      + internal_id                              = (known after apply)
      + login_with_email_allowed                 = (known after apply)
      + oauth2_device_code_lifespan              = (known after apply)
      + oauth2_device_polling_interval           = (known after apply)
      + offline_session_idle_timeout             = (known after apply)
      + offline_session_max_lifespan             = (known after apply)
      + offline_session_max_lifespan_enabled     = false
      + realm                                    = "argocd"
      + refresh_token_max_reuse                  = 0
      + registration_allowed                     = (known after apply)
      + registration_email_as_username           = (known after apply)
      + registration_flow                        = (known after apply)
      + remember_me                              = (known after apply)
      + reset_credentials_flow                   = (known after apply)
      + reset_password_allowed                   = (known after apply)
      + revoke_refresh_token                     = false
      + ssl_required                             = "external"
      + sso_session_idle_timeout                 = (known after apply)
      + sso_session_idle_timeout_remember_me     = (known after apply)
      + sso_session_max_lifespan                 = (known after apply)
      + sso_session_max_lifespan_remember_me     = (known after apply)
      + user_managed_access                      = false
      + verify_email                             = (known after apply)
    }

  # module.hub_cluster[0].keycloak_user.argocd_admin[0] will be created
  + resource "keycloak_user" "argocd_admin" {
      + email          = "admin@argocd.local"
      + email_verified = true
      + enabled        = true
      + first_name     = "ArgoCD"
      + id             = (known after apply)
      + last_name      = "Administrator"
      + realm_id       = (known after apply)
      + username       = "argocd-admin"
    }

  # module.hub_cluster[0].keycloak_user_groups.argocd_admin_groups[0] will be created
  + resource "keycloak_user_groups" "argocd_admin_groups" {
      + exhaustive = true
      + group_ids  = (known after apply)
      + id         = (known after apply)
      + realm_id   = (known after apply)
      + user_id    = (known after apply)
    }

  # module.hub_cluster[0].kubernetes_ingress_v1.argocd_ui[0] will be created
  + resource "kubernetes_ingress_v1" "argocd_ui" {
      + id     = (known after apply)
      + status = (known after apply)

      + metadata {
          + annotations      = {
              + "cert-manager.io/issuer"                         = "letsencrypt-prod"
              + "nginx.ingress.kubernetes.io/backend-protocol"   = "HTTP"
              + "nginx.ingress.kubernetes.io/force-ssl-redirect" = "true"
            }
          + generation       = (known after apply)
          + name             = "argocd-server"
          + namespace        = "argocd-agent"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }

      + spec {
          + ingress_class_name = "nginx"

          + rule {
              + host = "argocd.observe.camer.digital"

              + http {
                  + path {
                      + path      = "/"
                      + path_type = "Prefix"

                      + backend {
                          + service {
                              + name = "argocd-server"

                              + port {
                                  + number = 80
                                }
                            }
                        }
                    }
                }
            }

          + tls {
              + hosts       = [
                  + "argocd.observe.camer.digital",
                ]
              + secret_name = "argocd-server-tls"
            }
        }
    }

  # module.hub_cluster[0].kubernetes_namespace.hub_argocd will be created
  + resource "kubernetes_namespace" "hub_argocd" {
      + id                               = (known after apply)
      + wait_for_default_service_account = false

      + metadata {
          + generation       = (known after apply)
          + name             = "argocd-agent"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # module.hub_cluster[0].null_resource.hub_argocd_apps_any_namespace will be created
  + resource "null_resource" "hub_argocd_apps_any_namespace" {
      + id = (known after apply)
    }

  # module.hub_cluster[0].null_resource.hub_argocd_base_install will be created
  + resource "null_resource" "hub_argocd_base_install" {
      + id       = (known after apply)
      + triggers = {
          + "context"      = "gke_observe-472521_europe-west3_observe-prod-cluster"
          + "manifest_url" = "https://github.com/argoproj-labs/argocd-agent/install/kubernetes/argo-cd/principal?ref=v0.5.3"
          + "namespace"    = "argocd-agent"
          + "version"      = "v0.5.3"
        }
    }

  # module.hub_cluster[0].null_resource.hub_argocd_resource_health_config will be created
  + resource "null_resource" "hub_argocd_resource_health_config" {
      + id = (known after apply)
    }

  # module.hub_cluster[0].null_resource.hub_argocd_server_insecure[0] will be created
  + resource "null_resource" "hub_argocd_server_insecure" {
      + id = (known after apply)
    }

  # module.hub_cluster[0].null_resource.hub_disable_admin_user[0] will be created
  + resource "null_resource" "hub_disable_admin_user" {
      + id = (known after apply)
    }

  # module.hub_cluster[0].null_resource.hub_keycloak_oidc_config[0] will be created
  + resource "null_resource" "hub_keycloak_oidc_config" {
      + id = (known after apply)
    }

  # module.hub_cluster[0].null_resource.hub_keycloak_rbac[0] will be created
  + resource "null_resource" "hub_keycloak_rbac" {
      + id = (known after apply)
    }

  # module.hub_cluster[0].null_resource.hub_keycloak_restart_server[0] will be created
  + resource "null_resource" "hub_keycloak_restart_server" {
      + id = (known after apply)
    }

  # module.hub_cluster[0].null_resource.hub_keycloak_secret[0] will be created
  + resource "null_resource" "hub_keycloak_secret" {
      + id       = (known after apply)
      + triggers = {
          + "client_secret" = (sensitive value)
        }
    }

  # module.hub_cluster[0].null_resource.hub_pki_initialization will be created
  + resource "null_resource" "hub_pki_initialization" {
      + id       = (known after apply)
      + triggers = {
          + "context"   = "gke_observe-472521_europe-west3_observe-prod-cluster"
          + "namespace" = "argocd-agent"
        }
    }

  # module.hub_cluster[0].null_resource.hub_pki_jwt_signing_key will be created
  + resource "null_resource" "hub_pki_jwt_signing_key" {
      + id = (known after apply)
    }

  # module.hub_cluster[0].null_resource.hub_pki_principal_server_cert_initial will be created
  + resource "null_resource" "hub_pki_principal_server_cert_initial" {
      + id = (known after apply)
    }

  # module.hub_cluster[0].null_resource.hub_pki_principal_server_cert_updated will be created
  + resource "null_resource" "hub_pki_principal_server_cert_updated" {
      + id = (known after apply)
    }

  # module.hub_cluster[0].null_resource.hub_pki_resource_proxy_cert will be created
  + resource "null_resource" "hub_pki_resource_proxy_cert" {
      + id = (known after apply)
    }

  # module.hub_cluster[0].null_resource.hub_principal_allowed_namespaces_config will be created
  + resource "null_resource" "hub_principal_allowed_namespaces_config" {
      + id       = (known after apply)
      + triggers = {
          + "namespaces" = "default"
        }
    }

  # module.hub_cluster[0].null_resource.hub_principal_env_vars_config will be created
  + resource "null_resource" "hub_principal_env_vars_config" {
      + id       = (known after apply)
      + triggers = {
          + "config_version" = "v1"
        }
    }

  # module.hub_cluster[0].null_resource.hub_principal_installation will be created
  + resource "null_resource" "hub_principal_installation" {
      + id       = (known after apply)
      + triggers = {
          + "context"      = "gke_observe-472521_europe-west3_observe-prod-cluster"
          + "manifest_url" = "https://github.com/argoproj-labs/argocd-agent/install/kubernetes/principal?ref=v0.5.3"
          + "namespace"    = "argocd-agent"
          + "version"      = "v0.5.3"
        }
    }

  # module.hub_cluster[0].null_resource.hub_principal_resource_proxy_config will be created
  + resource "null_resource" "hub_principal_resource_proxy_config" {
      + id       = (known after apply)
      + triggers = {
          + "config_version" = "v1"
        }
    }

  # module.hub_cluster[0].null_resource.hub_principal_restart will be created
  + resource "null_resource" "hub_principal_restart" {
      + id = (known after apply)
    }

  # module.hub_cluster[0].null_resource.hub_redis_network_policy_patch will be created
  + resource "null_resource" "hub_redis_network_policy_patch" {
      + id = (known after apply)
    }

  # module.hub_cluster[0].null_resource.resource_proxy_credentials_secret[0] will be created
  + resource "null_resource" "resource_proxy_credentials_secret" {
      + id       = (known after apply)
      + triggers = {
          + "credentials_count" = "0"
        }
    }

  # module.hub_cluster[0].null_resource.resource_proxy_verification[0] will be created
  + resource "null_resource" "resource_proxy_verification" {
      + id = (known after apply)
    }

  # module.hub_cluster[0].null_resource.set_admin_password[0] will be created
  + resource "null_resource" "set_admin_password" {
      + id       = (known after apply)
      + triggers = {
          + "keycloak_url" = "https://keycloak-dev.observe.camer.digital"
          + "password"     = (sensitive value)
          + "temporary"    = "true"
          + "user_id"      = (known after apply)
        }
    }

  # module.spoke_cluster[0].null_resource.appproject_default_config[0] will be created
  + resource "null_resource" "appproject_default_config" {
      + id       = (known after apply)
      + triggers = {
          + "dest_namespaces"   = jsonencode(
                [
                  + "*",
                ]
            )
          + "hub_context"       = "gke_observe-472521_europe-west3_observe-prod-cluster"
          + "hub_namespace"     = "argocd-agent"
          + "source_namespaces" = jsonencode(
                [
                  + "*",
                ]
            )
        }
    }

  # module.spoke_cluster[0].null_resource.appproject_verify[0] will be created
  + resource "null_resource" "appproject_verify" {
      + id = (known after apply)
    }

Plan: 37 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + appproject_config   = {
      + dest_namespaces   = [
          + "*",
        ]
      + dest_server       = "*"
      + source_namespaces = [
          + "*",
        ]
    }
  + argocd_url          = "https://argocd.observe.camer.digital"
  + deployed_agents     = []
  + deployment_summary  = "✓ Hub cluster: gke_observe-472521_europe-west3_observe-prod-cluster | Principal: pending:8443 | Agents: "
  + keycloak_client_id  = "argocd"
  + keycloak_config     = {
      + auth_method = "Client Auth"
      + client_id   = "argocd"
      + groups      = "ArgoCDAdmins (admin), ArgoCDDevelopers (edit), ArgoCDViewers (readonly)"
      + realm       = "argocd"
      + url         = "https://keycloak-dev.observe.camer.digital/realms/argocd"
    }
  + management_commands = {
      + backup_pki     = "kubectl get secret argocd-agent-pki-ca -n argocd-agent --context gke_observe-472521_europe-west3_observe-prod-cluster -o yaml > pki-ca-backup-$(date +%%Y%%m%%d).yaml"
      + hub_pods       = "kubectl get pods -n argocd-agent --context gke_observe-472521_europe-west3_observe-prod-cluster"
      + list_agents    = "/usr/local/bin/argocd-agentctl agent list --principal-context gke_observe-472521_europe-west3_observe-prod-cluster --principal-namespace argocd-agent"
      + principal_logs = "kubectl logs -n argocd-agent deployment/argocd-agent-principal --context gke_observe-472521_europe-west3_observe-prod-cluster"
    }
  + pki_backup_warning  = "⚠️  CRITICAL: Backup PKI CA with: kubectl get secret argocd-agent-pki-ca -n argocd-agent --context gke_observe-472521_europe-west3_observe-prod-cluster -o yaml > pki-ca-backup.yaml"
  + principal_address   = "pending"
  + principal_port      = "8443"

```